Repository: gpapasteriadis/PersonalWebSite
Catalog: Resources/Localize.Resource.*.resx
Languages: el

# .NetCoreDesc
source: I've used this to build APIs, Backend services and Frontend solutions.
el: Το έχω χρησιμοποιήσει για να δημιουργήσω APIs, Backend services και Frontend solutions.

# About
source: I'm a software engineer specializing in web development.<br/><br/> In my work, what fills me up is finding solutions to problems, exploring new technologies and feeling like I'm contributing to the team. I seek to work in environments that promote continuous learning and growth. As for my preferences, I'm more interested in backend technologies and want to delve quite deep into system design.<br /><br/> In my spare time, I enjoy working out and going on motorcycle trips, they give me energy and help me escape from the daily routine.
el: Είμαι μηχανικός λογισμικού και ειδικεύομαι στην ανάπτυξη Web εφαρμογών.<br/><br/> Στη δουλειά μου, αυτό που με γεμίζει είναι να βρίσκω λύσεις σε προβλήματα, να εξερευνώ νέες τεχνολογίες και να νιώθω ότι συνεισφέρω στην ομάδα. Επιδιώκω να εργάζομαι σε περιβάλλοντα που προωθούν τη συνεχή μάθηση και ανάπτυξη. Όσον αφορά τις προτιμήσεις μου, με ενδιαφέρουν περισσότερο οι backend τεχνολογίες και θέλω να εμβαθύνω αρκετά στο σχεδιασμό συστημάτων.<br /><br/> Στον ελεύθερό μου χρόνο μου αρέσει να γυμνάζομαι και να κάνω εξορμήσεις με τη μηχανή, μου δίνουν ενέργεια και με βοηθούν να ξεφύγω από την καθημερινότητα.

# AngularDesc
source: My experience is mainly in Angular2 and I have dabbled in AngularJS as well. Some libraries/tools I have used are Angular Material and Bootstrap.
el: Η εμπειρία μου είναι κυρίως στην Angular 2, καθώς επίσης και στην AngularJS. Σε κάποιες από τις βιβλιοθήκες/εργαλεία που έχω χρησιμοποιήσει περιλαμβάνεται το Angular Material και το Bootstrap.

# Army
source: Greek Army
el: Ελληνικός Στρατός

# ArmyDate
source: Mar - Oct 2023
el: Μάρτιος - Οκτ 2023

# PwCDate
source: May 2024 - Present
el: Μάιος 2024 - Σήμερα

# ArmyDepartment
source: Greek Armed Forces IT Corps
el: Σώμα Πληροφορικής Ελληνικών Ενόπλων Δυνάμεων

# ArmyDesc
source: During Mandatory Military Service:<br/> • Developed and maintained internal software systems to support operational needs.<br/> • Provided technical support to end users, resolving inquiries and troubleshooting issues.<br/> • Contributed to ongoing improvements and enhancements of critical applications.
el: Κατά τη διάρκεια της Υποχρεωτικής Στρατιωτικής Θητείας:<br/> • Ανέπτυξα και συντήρησα εσωτερικά συστήματα λογισμικού για την υποστήριξη επιχειρησιακών αναγκών.<br/> • Παρείχα τεχνική υποστήριξη στους τελικούς χρήστες, επιλύοντας αιτήματα και αντιμετωπίζοντας προβλήματα.<br/> • Συνέβαλα στη συνεχή βελτίωση και αναβάθμιση κρίσιμων εφαρμογών.

source: Back
el: Πίσω

# BlazorDesc
source: Helped me to build responsive modern web applications. I have used Syncfusion and Mudblazor libraries to leverage blazor features with ease.
el: Με βοήθησε στη δημιουργία προσαρμόσιμων, σύγχρονων web εφαρμογών. Χρησιμοποίησα τις βιβλιοθήκες Syncfusion και MudBlazor για να εκμεταλλευτώ με ευκολία τα χαρακτηριστικά του Blazor.

# BuildBy
source: Built and designed by <br> George Papasteriadis
el: Κατασκευάστηκε και σχεδιάστηκε από τον <br> Γιώργο Παπαστεριάδη

source: Contact
el: Επικοινωνία

# Contact1
source: Contact
el: Επικοινωνία

# ContactTitle
source: <b>Reach Out😉</b>
el: <b>Επικοινωνήστε😉</b>

# CothetaDate
source: Jul - Oct 2019
el: Ιουλ - Οκτ 2019

# CothetaDesc
source: • Developed VR/AR projects with Unity3D, creating interactive experiences.
el: • Ανέπτυξα έργα Εικονικής και Επαυξημένης Πραγματικότητας με το Unity3D, δημιουργώντας διαδραστικές εμπειρίες.

# CV
source: Resume:
el: Βιογραφικό:

# DockerDesc
source: Docker has enabled me to seamlessly package and deploy applications with ease. Α few examples of some of the types of applications I have Dockerized are: .ΝΕΤ6 Services, NestJS App, Databases, Message Brokers, Frontend Solutions.
el: Το Docker μου επέτρεψε να πακετάρω και να αναπτύξω εφαρμογές με ευκολία. Μερικά παραδείγματα εφαρμογών που έχω χρησιμοποιήσει το Docker είναι: .NET 6 services, NestJS εφαρμογές, Bάσεις δεδομένων, Message Brokers, Frontend solutions.

# EFCoreDesc
source: I gained experience in EF Core mainly through online courses but also through applying it in a work environment.
el: Απέκτησα εμπειρία στο EF Core κυρίως μέσω διαδικτυακών μαθημάτων αλλά και μέσω εφαρμογής του σε περιβάλον εργασίας.

source: Experience
el: Εμπειρία

# ExperienceTitle
source: <b>Where I’ve Worked</b>
el: <b>Που έχω εργαστεί</b>

# FindMe
source: You can also find me on the following social networks
el: Μπορείτε επίσης να με βρείτε στα παρακάτω κοινωνικά δίκτυα

# MobileAppDesc
source: As a freelancer, I undertook a one-month project to develop a mobile application. FoodWaste application enables users to effortlessly input and categorize leftover food items, providing useful analytics to help them understand their consumption habits better.<br><br> <b>Implementation Details:</b><br> · Leveraging the Ionic Framework integrated with Angular, I crafted dynamic user interfaces for seamless experiences across both Android and iOS platforms.<br /> · In the backend, I employed Apollo GraphQL and nestJS to build a robust system. MongoDB was utilized for data storage and retrieval.<br /> · Deployment was done on DigitalOcean using Docker containers. This approach allowed for agile packaging and deployment.
el: Ως ελεύθερος επαγγελματίας, ανέλαβα ένα έργο ενός μήνα για την ανάπτυξη μιας εφαρμογής για κινητά. Η εφαρμογή FoodWaste επιτρέπει στους χρήστες να εισάγουν και να κατηγοριοποιούν εύκολα τα υπολείμματα τροφίμων, παρέχοντας χρήσιμα στοιχεία που τους βοηθούν να κατανοήσουν καλύτερα τις καταναλωτικές τους συνήθειες.<br><br> <b>Λεπτομέρειες υλοποίησης:</b><br> · Χρησιμοποιώντας το Ionic Framework με την Angular, δημιούργησα δυναμικές διεπαφές χρήστη για Android και iOS λογισμικά.<br /> · Στο backend, χρησιμοποίησα το Apollo GraphQL και το nestJS για να δημιουργήσω ένα αποδοτικό σύστημα. Το MongoDB χρησιμοποιήθηκε για αποθήκευση και ανάκτηση δεδομένων.<br /> · Για περιβάλον παραγωγής επέλεξα το DigitalOcean χρησιμοποιώντας Docker containers. Αυτή η προσέγγιση επέτρεψε την ευέλικτη μεταφορά της εφαρμογής απο περιβάλον ανάπτυξης σε παραγωγής.

# MobileAppShowSample
source: Click to see a sample
el: Κάντε κλικ για να δείτε ένα δείγμα

# MobileAppTitle2
source: <u>Android/iOS FoodWaste App - Sample Images/Video</u>
el: <u>Android/iOS FoodWaste App - Δείγμα φωτογραφιών/Βίντεο</u>

# MongoDBDesc
source: My experience with mongoDB is based on a job I had as a freelancer. I was using it with Mongoose (ODM) and mongo-express (Admin Interface).
el: Η εμπειρία μου με το MongoDB βασίζεται σε μια εργασία που είχα ως ελεύθερος επαγγελματίας. Χρησιμοποίησα το Mongoose (ODM) και το mongo-express (Διεπαφή Διαχειριστή).

# MyName
source: <b>George Papasteriadis</b>
el: <b>Γιώργος Παπαστεριάδης</b>

source: Personal Website
el: Προσωπική Ιστοσελίδα

# PersonalWebsiteDesc
source: This project serves as a portfolio to showcase my projects, skills, and work experience in web development.<br><br> <b>Implementation Details:</b><br> ·Built using Blazor with .NET 8 and the MudBlazor library. A dynamic client-side web application that adapts effortlessly to any screen, whether you're browsing on a desktop, tablet, or smartphone.<br> ·Hosted on Microsoft Azure using the Static Web Apps service.<br> ·The codebase stored on GitHub, leveraging GitHub Actions for Continuous Integration and Continuous Development (CI/CD), which helps updates and enhancements roll out seamlessly.
el: Αυτό το project χρησιμεύει ως χαρτοφυλάκιο για να παρουσιάσω τα projects, τις δεξιότητες και την εργασιακή μου εμπειρία στo web development.<br><br> <b>Λεπτομέρειες υλοποίησης:</b><br> ·Δημιουργήθηκε χρησιμοποιώντας Blazor με .NET 8 και τη βιβλιοθήκη MudBlazor. Μια δυναμική client-side εφαρμογή που προσαρμόζεται εύκολα σε οποιαδήποτε οθόνη, είτε κάνετε περιήγηση σε επιτραπέζιο υπολογιστή, tablet ή smartphone.<br> · Φιλοξενείται στο Microsoft Azure χρησιμοποιώντας την υπηρεσία Static Web Apps.<br> ·Ο κώδικας είναι αποθηκευμένος στο GitHub, αξιοποιώντας το GitHub Actions για Continuous Integration και Continuous Development (CI/CD), το οποίο βοηθά τις ενημερώσεις και τις βελτιώσεις της εφαρμογής να βγαίνουν στην παραγωγή απρόσκοπτα.

# PersonalWebsiteTitle
source: <u>My First Personal Website</u>
el: <u>Η πρώτη μου προσωπική ιστοσελίδα</u>

source: Phase
el: Φάση

# ProjectsTitle
source: <b>Some projects</b>
el: <b>Μερικά projects</b>

# RabbitMQDesc
source: Leveraging the library in C#, I successfully implemented it for various scenarios including asynchronous email dispatch, push notifications, and job scheduling, thereby enhancing system responsiveness and scalability.
el: Υλοποιώντας τη βιβλιοθήκη στην γλώσσα C#, την χρησιμοποίησα για διάφορες περιπτώσεις, συμπεριλαμβανομένης της ασύγχρονης αποστολής email, της αποστολής ειδοποιήσεων σε εφαρμογές κινητών, και του προγραμματισμού εργασιών, βελτιώνοντας έτσι την αποκρισιμότητα και την κλιμακωσιμότητα του συστήματος.

# Salutation
source: Hello!👋 my name is
el: Γειά!👋 Ονομάζομαι

# SendMeMail
source: Send Me Email
el: Στείλτε μου Email

source: Service Booking
el: Κρατήσεις Υπηρεσιών

# ServiceBookingDesc
source: The Local Services Booking Platform is a personal side project that aims to provide users with a convenient and efficient way to access local services in their area. I am building this platform to connect users with reliable service providers for various needs like house cleaning, personal training, tutoring and more.<br><br> <b>Implementation details:</b><br> · <em>Frontend Development:</em><br> For the Frontend, I will be using Blazor in .NET 8, enhancing it with the MudBlazor library. Also, I will use ASP.NET Core Identity in conjunction with a dedicated database for user authentication and authorization.<br> · <em>Backend Services:</em><br> For the Backend I will use a Web API in .NET 8 to communicate with the Frontend and Entity Framework Core as an ORM to access the data. The main database I will use will be MSSQL for easy data storage and retrieval<br> ·<em>Key Components:</em> <br> Redis will be used to cache data that does not change frequently and has increased demand from users, improving application performance and mitigating database load and latency. Elasticsearch will be used to store log files but will also serve the search function of users, it will also be complemented by Kibana for the visualization and analysis of log files. Real-time user interface updates will be possible by leveraging SignalR. Finally RabbitMQ will act as a message broker for asynchronous communication between core services, such as the Email Worker for sending emails asynchronously and the Hangfire Worker for performing various tasks in the background.<br> · <em>Deployment Infrastructure:</em><br> The deployment infrastructure will be hosted on Azure, using Docker containers to package all the individual parts of the application.
el: Η Πλατφόρμα Κρατήσεων Τοπικών Υπηρεσιών είναι ένα προσωπικό side project που στοχεύει να παρέχει στους χρήστες έναν βολικό και αποτελεσματικό τρόπο πρόσβασης στις τοπικές υπηρεσίες της περιοχής τους. Φτιάχνω αυτήν την πλατφόρμα για να συνδέω τους χρήστες με αξιόπιστους παρόχους υπηρεσιών για διάφορες ανάγκες, όπως καθαρισμός σπιτιού, personal training, διδασκαλία και άλλα.<br><br> <b>Λεπτομέρειες υλοποίησης:</b><br> · <em>Ανάπτυξη του Frontend:</em><br> Για το Frontend, θα χρησιμοποιήσω το Blazor στο .NET 8, εμπλουτίζοντάς το με τη βιβλιοθήκη MudBlazor. Ακόμα, θα χρησιμοποιήσω το ASP.NET Core Identity σε συνδυασμό με μια αποκλειστική βάση δεδομένων για τον έλεγχο ταυτότητας και την εξουσιοδότηση των χρηστών.<br> · <em>Υπηρεσίες Backend:</em><br> Για το Backend θα χρησιμοποιήσω ενα Web API στο .NET 8 για την επικοινωνία με το Frontend και το Entity Framework Core ως ORM για την πρόσβαση στα δεδομένα. Η κύρια βάση που θα χρησιμοποιήσω θα ειναι το MSSQL για εύκολη αποθήκευση και ανάκτηση δεδομένων<br> ·<em>Βασικά Στοιχεία:</em> <br> Το Redis θα χρησιμοποιηθεί για την προσωρινή αποθήκευση δεδομένων τα οποία δεν μεταβάλονται συχνά και έχουν αυξημένη ζήτηση απο τους χρήστες, βελτιώνοντας την απόδοση της εφαρμογής και μετριάζοντας το φόρτο της βάσης δεδομένων και την καθυστέρηση. Το Elasticsearch θα χρησιμοποιηθεί για την αποθήκευση log αρχείων αλλά θα εξυπηρετήσει και την λειτουργία αναζήτησης των χρηστών, θα συμπληρωθεί και από το Kibana για την οπτικοποίηση και ανάλυση των log αρχείων. Οι ενημερώσεις της διεπαφής σε πραγματικό χρόνο θα είναι εφικτές αξιοποιώντας το SignalR. Τέλος το RabbitMQ θα λειτουργεί ως διαμεσολαβητής μηνυμάτων για την ασύγχρονη επικοινωνία μεταξύ βασικών υπηρεσιών, όπως ο Email Worker για ασύγχρονη αποστολή email και ο Hangfire Worker για την εκτέλεση διάφορων εργασιών στο παρασκήνιο.<br> · <em>Υποδομή ανάπτυξης:</em><br> Η υποδομή ανάπτυξης θα φιλοξενηθεί στο Azure, χρησιμοποιώντας Docker containers για το packaging όλων των επιμέρους τμημάτων της εφαρμογής.

# ServiceBookingDesign
source: Service Booking System Design
el: Σχεδίαση του Συστήματος Κρατήσεων Υπηρεσιών

# ServiceBookingTitle
source: <u>Local Service Booking Web App</u>
el: <u>Εφαρμογή Κρατήσεων Τοπικών Υπηρεσιών</u>

# SignalRDesc
source: In a previous role, I leveraged SignalR to facilitate real-time updates within the frontend, implementing it in both C# and JavaScript.
el: Σε προηγούμενο ρόλο, αξιοποίησα το SignalR για την ενημέρωση του UI σε πραγματικό χρόνο, εφαρμόζοντάς το τόσο στη C# όσο και στη JavaScript.

# SkillAcquired
source: Was acquired through:
el: Αποκτήθηκε μέσω:

# SkillAcquired_Job
source: Job
el: Εργασία

# SkillAcquired_JobCourse
source: Job, Courses
el: Εργασία, Μαθήματα

# SkillAcquired_JobProject
source: Job, Projects
el: Εργασία, Projects

# SkillAcquired_JobProjectCourse
source: Job, Projects, Courses
el: Εργασία, Projects, Μαθήματα

source: Skills
el: Δεξιότητες

# SkillsTitle
source: <b>Skills/Tools acquired</b>
el: <b>Δεξιότητες/Εργαλεία που αποκτήθηκαν</b>

# SoftwareEngineer
source: <b>Software Engineer</b>
el: <b>Μηχανικός Λογισμικού</b>

# SoftwareEngineerIntern
source: <b>Software Engineer Intern </b>
el: <b>Πρακτική Άσκηση ως Μηχανικός Λογισμικού</b>

# SQLDesc
source: In almost every project I've taken on, I've used SQL by integrating it with various ORMs like EFCore and Sequelize. Additionally, I have used raw SQL queries extensively.
el: Σε σχεδόν κάθε έργο που ανέλαβα, χρησιμοποίησα την SQL ενσωματώνοντάς τη με διάφορα ORMs όπως το EFCore και το Sequelize. Επιπλέον, εχω χρησιμοποιήσει εκτενώς απλά ερωτήματα SQL.

source: System Design
el: Σχεδίαση του Συστήματος

# TerracomDate
source: Oct 2020 - Dec 2022
el: Οκτ 2020 - Δεκ 2022

# TerracomDesc
source: • Played a key role in developing and maintaining the QR-Patrol security management platform.<br/> • Actively contributed to technical analysis and system design, driving enhancements to project outcomes.<br/> • Collaborated closely with team members in regular meetings to align efforts, implement updates, and continuously improve the platform.
el: • Διαδραμάτισα βασικό ρόλο στην ανάπτυξη και συντήρηση της πλατφόρμας QR-Patrol.<br/> • Συμμετείχα ενεργά στην τεχνική ανάλυση και το σχεδιασμό συστημάτων, συμβάλλοντας στη βελτίωση των αποτελεσμάτων του έργου.<br/> • Συνεργάστηκα στενά με τα μέλη της ομάδας σε τακτικές συναντήσεις για ευθυγράμμιση προσπαθειών, υλοποίηση ενημερώσεων και συνεχή βελτίωση της πλατφόρμας.

# UnderConstruction
source: <b> Under Construction </b>
el: <b> Υπό κατασκευή </b>

# PwCDesc
source: <b>🖥️ Web Development & UI:</b><br/> • Developed web applications using .NET 8, Blazor Server, and ASP.NET MVC.<br/> • Built modern, responsive UIs with MudBlazor and JavaScript.<br/> <b>🛠️ Backend & Data Operations:</b><br/> • Worked with SQL Server databases using Stored Procedures and raw SQL for complex queries.<br/> • Managed data access with Entity Framework Core.<br/> <b>⏱️ Background Processing & Automation:</b><br/> • Integrated Hangfire for task scheduling and email notifications.<br/> <b>🚀 DevOps & Project Management:</b><br/> • Managed the full development lifecycle in Azure DevOps, including CI/CD pipelines and project tracking.
el: <b>🖥️ Ανάπτυξη Ιστοσελίδων & Διεπαφή Χρήστη:</b><br/> • Ανάπτυξη web εφαρμογών χρησιμοποιώντας .NET 8, Blazor Server και ASP.NET MVC.<br/> • Δημιουργία μοντέρνων, responsive διεπαφών με MudBlazor και JavaScript.<br/> <b>🛠️ Backend & Διαχείριση Δεδομένων:</b><br/> • Εργασία με βάσεις δεδομένων SQL Server χρησιμοποιώντας Stored Procedures και raw SQL για σύνθετα ερωτήματα.<br/> • Διαχείριση πρόσβασης σε δεδομένα με Entity Framework Core.<br/> <b>⏱️ Επεξεργασία Παρασκηνίου & Αυτοματοποίηση:</b><br/> • Ενσωμάτωση του Hangfire για προγραμματισμό εργασιών και ειδοποιήσεις μέσω email.<br/> <b>🚀 DevOps & Διαχείριση Έργων:</b><br/> • Διαχείριση ολόκληρου του κύκλου ανάπτυξης στο Azure DevOps, περιλαμβάνοντας CI/CD pipelines και παρακολούθηση έργου.
